GopalSaraf/Practicals/PSDL/include/proc/pic18f05q41.inc
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TS                               BANKMASK(SMT1STAT), 2, b
#define TSEL0                            BANKMASK(SCANTRIG), 0, b
#define TSEL1                            BANKMASK(SCANTRIG), 1, b
#define TSEL2                            BANKMASK(SCANTRIG), 2, b
#define TSEL3                            BANKMASK(SCANTRIG), 3, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TXU                              BANKMASK(I2C1CON1), 1, b
#define U1ABDEN                          BANKMASK(U1CON0), 6, b
#define U1ABDIE                          BANKMASK(U1UIR), 2, b
#define U1ABDIF                          BANKMASK(U1UIR), 6, b
#define U1ABDOVE                         BANKMASK(U1ERRIE), 5, b
#define U1ABDOVF                         BANKMASK(U1ERRIR), 5, b
#define U1BRGS                           BANKMASK(U1CON0), 7, b
#define U1BRKOVR                         BANKMASK(U1CON1), 1, b
#define U1C0EN                           BANKMASK(U1CON2), 3, b
#define U1CERIE                          BANKMASK(U1ERRIE), 4, b
#define U1CERIF                          BANKMASK(U1ERRIR), 4, b
#define U1CTSPPS0                        BANKMASK(U1CTSPPS), 0, b
#define U1CTSPPS1                        BANKMASK(U1CTSPPS), 1, b
#define U1CTSPPS2                        BANKMASK(U1CTSPPS), 2, b
#define U1CTSPPS3                        BANKMASK(U1CTSPPS), 3, b
#define U1CTSPPS4                        BANKMASK(U1CTSPPS), 4, b
#define U1CTSPPS5                        BANKMASK(U1CTSPPS), 5, b
#define U1EIE                            BANKMASK(PIE4), 2, a
#define U1EIF                            BANKMASK(PIR4), 2, a
#define U1EIP                            BANKMASK(IPR4), 2, b
#define U1FERIE                          BANKMASK(U1ERRIE), 3, b
#define U1FERIF                          BANKMASK(U1ERRIR), 3, b
#define U1FLO0                           BANKMASK(U1CON2), 0, b
#define U1FLO1                           BANKMASK(U1CON2), 1, b
#define U1IE                             BANKMASK(PIE4), 3, a
#define U1IF                             BANKMASK(PIR4), 3, a
#define U1IP                             BANKMASK(IPR4), 3, b
#define U1MD                             BANKMASK(PMD3), 6, b
#define U1MODE0                          BANKMASK(U1CON0), 0, b
#define U1MODE1                          BANKMASK(U1CON0), 1, b
#define U1MODE2                          BANKMASK(U1CON0), 2, b
#define U1MODE3                          BANKMASK(U1CON0), 3, b
#define U1ON                             BANKMASK(U1CON1), 7, b
#define U1PERIE                          BANKMASK(U1ERRIE), 6, b
#define U1PERIF                          BANKMASK(U1ERRIR), 6, b
#define U1RCIDL                          BANKMASK(U1FIFO), 3, b
#define U1RUNOVF                         BANKMASK(U1CON2), 7, b
#define U1RXBE                           BANKMASK(U1FIFO), 1, b
#define U1RXBF                           BANKMASK(U1FIFO), 0, b
#define U1RXBIMD                         BANKMASK(U1CON1), 3, b
#define U1RXBKIE                         BANKMASK(U1ERRIE), 2, b
#define U1RXBKIF                         BANKMASK(U1ERRIR), 2, b
#define U1RXEN                           BANKMASK(U1CON0), 4, b
#define U1RXFOIE                         BANKMASK(U1ERRIE), 1, b
#define U1RXFOIF                         BANKMASK(U1ERRIR), 1, b
#define U1RXIDL                          BANKMASK(U1FIFO), 3, b
#define U1RXIE                           BANKMASK(PIE4), 0, a
#define U1RXIF                           BANKMASK(PIR4), 0, a
#define U1RXIP                           BANKMASK(IPR4), 0, b
#define U1RXPOL                          BANKMASK(U1CON2), 6, b
#define U1RXPPS0                         BANKMASK(U1RXPPS), 0, b
#define U1RXPPS1                         BANKMASK(U1RXPPS), 1, b
#define U1RXPPS2                         BANKMASK(U1RXPPS), 2, b
#define U1RXPPS3                         BANKMASK(U1RXPPS), 3, b
#define U1RXPPS4                         BANKMASK(U1RXPPS), 4, b
#define U1RXPPS5                         BANKMASK(U1RXPPS), 5, b
#define U1SENDB                          BANKMASK(U1CON1), 0, b
#define U1STP0                           BANKMASK(U1CON2), 4, b
#define U1STP1                           BANKMASK(U1CON2), 5, b
#define U1STPMD                          BANKMASK(U1FIFO), 6, b
#define U1TXBE                           BANKMASK(U1FIFO), 5, b
#define U1TXBF                           BANKMASK(U1FIFO), 4, b
#define U1TXCIE                          BANKMASK(U1ERRIE), 0, b
#define U1TXCIF                          BANKMASK(U1ERRIR), 0, b
#define U1TXEN                           BANKMASK(U1CON0), 5, b
#define U1TXIE                           BANKMASK(PIE4), 1, a
#define U1TXIF                           BANKMASK(PIR4), 1, a
#define U1TXIP                           BANKMASK(IPR4), 1, b
#define U1TXMTIE                         BANKMASK(U1ERRIE), 7, b
#define U1TXMTIF                         BANKMASK(U1ERRIR), 7, b
#define U1TXPOL                          BANKMASK(U1CON2), 2, b
#define U1TXWRE                          BANKMASK(U1FIFO), 7, b
#define U1WUE                            BANKMASK(U1CON1), 4, b
#define U1WUIF                           BANKMASK(U1UIR), 7, b
#define U1XON                            BANKMASK(U1FIFO), 2, b
#define U2ABDEN                          BANKMASK(U2CON0), 6, b
#define U2ABDIE                          BANKMASK(U2UIR), 2, b
#define U2ABDIF                          BANKMASK(U2UIR), 6, b
#define U2ABDOVE                         BANKMASK(U2ERRIE), 5, b
#define U2ABDOVF                         BANKMASK(U2ERRIR), 5, b
#define U2BRGS                           BANKMASK(U2CON0), 7, b
#define U2BRKOVR                         BANKMASK(U2CON1), 1, b
#define U2CERIE                          BANKMASK(U2ERRIE), 4, b
#define U2CERIF                          BANKMASK(U2ERRIR), 4, b
#define U2CTSPPS0                        BANKMASK(U2CTSPPS), 0, b
#define U2CTSPPS1                        BANKMASK(U2CTSPPS), 1, b
#define U2CTSPPS2                        BANKMASK(U2CTSPPS), 2, b
#define U2CTSPPS3                        BANKMASK(U2CTSPPS), 3, b
#define U2CTSPPS4                        BANKMASK(U2CTSPPS), 4, b
#define U2CTSPPS5                        BANKMASK(U2CTSPPS), 5, b
#define U2EIE                            BANKMASK(PIE8), 2, a
#define U2EIF                            BANKMASK(PIR8), 2, a
#define U2EIP                            BANKMASK(IPR8), 2, b
#define U2FERIE                          BANKMASK(U2ERRIE), 3, b
#define U2FERIF                          BANKMASK(U2ERRIR), 3, b
#define U2FLO0                           BANKMASK(U2CON2), 0, b
#define U2FLO1                           BANKMASK(U2CON2), 1, b
#define U2IE                             BANKMASK(PIE8), 3, a
#define U2IF                             BANKMASK(PIR8), 3, a
#define U2IP                             BANKMASK(IPR8), 3, b
#define U2MD                             BANKMASK(PMD3), 7, b
#define U2MODE0                          BANKMASK(U2CON0), 0, b
#define U2MODE1                          BANKMASK(U2CON0), 1, b
#define U2MODE2                          BANKMASK(U2CON0), 2, b
#define U2ON                             BANKMASK(U2CON1), 7, b
#define U2PERIE                          BANKMASK(U2ERRIE), 6, b
#define U2PERIF                          BANKMASK(U2ERRIR), 6, b
#define U2RCIDL                          BANKMASK(U2FIFO), 3, b
#define U2RUNOVF                         BANKMASK(U2CON2), 7, b
#define U2RXBE                           BANKMASK(U2FIFO), 1, b
#define U2RXBF                           BANKMASK(U2FIFO), 0, b
#define U2RXBIMD                         BANKMASK(U2CON1), 3, b
#define U2RXBKIE                         BANKMASK(U2ERRIE), 2, b
#define U2RXBKIF                         BANKMASK(U2ERRIR), 2, b
#define U2RXEN                           BANKMASK(U2CON0), 4, b
#define U2RXFOIE                         BANKMASK(U2ERRIE), 1, b
#define U2RXFOIF                         BANKMASK(U2ERRIR), 1, b
#define U2RXIDL                          BANKMASK(U2FIFO), 3, b
#define U2RXIE                           BANKMASK(PIE8), 0, a
#define U2RXIF                           BANKMASK(PIR8), 0, a
#define U2RXIP                           BANKMASK(IPR8), 0, b
#define U2RXPOL                          BANKMASK(U2CON2), 6, b
#define U2RXPPS0                         BANKMASK(U2RXPPS), 0, b
#define U2RXPPS1                         BANKMASK(U2RXPPS), 1, b
#define U2RXPPS2                         BANKMASK(U2RXPPS), 2, b
#define U2RXPPS3                         BANKMASK(U2RXPPS), 3, b
#define U2RXPPS4                         BANKMASK(U2RXPPS), 4, b
#define U2RXPPS5                         BANKMASK(U2RXPPS), 5, b
#define U2SENDB                          BANKMASK(U2CON1), 0, b
#define U2STP0                           BANKMASK(U2CON2), 4, b
#define U2STP1                           BANKMASK(U2CON2), 5, b
#define U2STPMD                          BANKMASK(U2FIFO), 6, b
#define U2TXBE                           BANKMASK(U2FIFO), 5, b
#define U2TXBF                           BANKMASK(U2FIFO), 4, b
#define U2TXCIE                          BANKMASK(U2ERRIE), 0, b
#define U2TXCIF                          BANKMASK(U2ERRIR), 0, b
#define U2TXEN                           BANKMASK(U2CON0), 5, b
#define U2TXIE                           BANKMASK(PIE8), 1, a
#define U2TXIF                           BANKMASK(PIR8), 1, a
#define U2TXIP                           BANKMASK(IPR8), 1, b
#define U2TXMTIE                         BANKMASK(U2ERRIE), 7, b
#define U2TXMTIF                         BANKMASK(U2ERRIR), 7, b
#define U2TXPOL                          BANKMASK(U2CON2), 2, b
#define U2TXWRE                          BANKMASK(U2FIFO), 7, b
#define U2WUE                            BANKMASK(U2CON1), 4, b
#define U2WUIF                           BANKMASK(U2UIR), 7, b
#define U2XON                            BANKMASK(U2FIFO), 2, b
#define U3ABDEN                          BANKMASK(U3CON0), 6, b
#define U3ABDIE                          BANKMASK(U3UIR), 2, b
#define U3ABDIF                          BANKMASK(U3UIR), 6, b
#define U3ABDOVE                         BANKMASK(U3ERRIE), 5, b
#define U3ABDOVF                         BANKMASK(U3ERRIR), 5, b
#define U3BRGS                           BANKMASK(U3CON0), 7, b
#define U3BRKOVR                         BANKMASK(U3CON1), 1, b
#define U3CERIE                          BANKMASK(U3ERRIE), 4, b
#define U3CERIF                          BANKMASK(U3ERRIR), 4, b
#define U3CTSPPS0                        BANKMASK(U3CTSPPS), 0, b
#define U3CTSPPS1                        BANKMASK(U3CTSPPS), 1, b
#define U3CTSPPS2                        BANKMASK(U3CTSPPS), 2, b
#define U3CTSPPS3                        BANKMASK(U3CTSPPS), 3, b
#define U3CTSPPS4                        BANKMASK(U3CTSPPS), 4, b
#define U3CTSPPS5                        BANKMASK(U3CTSPPS), 5, b
#define U3EIE                            BANKMASK(PIE9), 2, a
#define U3EIF                            BANKMASK(PIR9), 2, a
#define U3EIP                            BANKMASK(IPR9), 2, b
#define U3FERIE                          BANKMASK(U3ERRIE), 3, b
#define U3FERIF                          BANKMASK(U3ERRIR), 3, b
#define U3FLO0                           BANKMASK(U3CON2), 0, b
#define U3FLO1                           BANKMASK(U3CON2), 1, b
#define U3IE                             BANKMASK(PIE9), 3, a
#define U3IF                             BANKMASK(PIR9), 3, a
#define U3IP                             BANKMASK(IPR9), 3, b
#define U3MD                             BANKMASK(PMD4), 0, b
#define U3MODE0                          BANKMASK(U3CON0), 0, b
#define U3MODE1                          BANKMASK(U3CON0), 1, b
#define U3MODE2                          BANKMASK(U3CON0), 2, b
#define U3ON                             BANKMASK(U3CON1), 7, b
#define U3PERIE                          BANKMASK(U3ERRIE), 6, b
#define U3PERIF                          BANKMASK(U3ERRIR), 6, b
#define U3RCIDL                          BANKMASK(U3FIFO), 3, b
#define U3RUNOVF                         BANKMASK(U3CON2), 7, b
#define U3RXBE                           BANKMASK(U3FIFO), 1, b
#define U3RXBF                           BANKMASK(U3FIFO), 0, b
#define U3RXBIMD                         BANKMASK(U3CON1), 3, b
#define U3RXBKIE                         BANKMASK(U3ERRIE), 2, b
#define U3RXBKIF                         BANKMASK(U3ERRIR), 2, b
#define U3RXEN                           BANKMASK(U3CON0), 4, b
#define U3RXFOIE                         BANKMASK(U3ERRIE), 1, b
#define U3RXFOIF                         BANKMASK(U3ERRIR), 1, b
#define U3RXIDL                          BANKMASK(U3FIFO), 3, b
#define U3RXIE                           BANKMASK(PIE9), 0, a
#define U3RXIF                           BANKMASK(PIR9), 0, a
#define U3RXIP                           BANKMASK(IPR9), 0, b
#define U3RXPOL                          BANKMASK(U3CON2), 6, b
#define U3RXPPS0                         BANKMASK(U3RXPPS), 0, b
#define U3RXPPS1                         BANKMASK(U3RXPPS), 1, b
#define U3RXPPS2                         BANKMASK(U3RXPPS), 2, b
#define U3RXPPS3                         BANKMASK(U3RXPPS), 3, b
#define U3RXPPS4                         BANKMASK(U3RXPPS), 4, b
#define U3RXPPS5                         BANKMASK(U3RXPPS), 5, b
#define U3SENDB                          BANKMASK(U3CON1), 0, b
#define U3STP0                           BANKMASK(U3CON2), 4, b
#define U3STP1                           BANKMASK(U3CON2), 5, b
#define U3STPMD                          BANKMASK(U3FIFO), 6, b
#define U3TXBE                           BANKMASK(U3FIFO), 5, b
#define U3TXBF                           BANKMASK(U3FIFO), 4, b
#define U3TXCIE                          BANKMASK(U3ERRIE), 0, b
#define U3TXCIF                          BANKMASK(U3ERRIR), 0, b
#define U3TXEN                           BANKMASK(U3CON0), 5, b
#define U3TXIE                           BANKMASK(PIE9), 1, a
#define U3TXIF                           BANKMASK(PIR9), 1, a
#define U3TXIP                           BANKMASK(IPR9), 1, b
#define U3TXMTIE                         BANKMASK(U3ERRIE), 7, b
#define U3TXMTIF                         BANKMASK(U3ERRIR), 7, b
#define U3TXPOL                          BANKMASK(U3CON2), 2, b
#define U3TXWRE                          BANKMASK(U3FIFO), 7, b
#define U3WUE                            BANKMASK(U3CON1), 4, b
#define U3WUIF                           BANKMASK(U3UIR), 7, b
#define U3XON                            BANKMASK(U3FIFO), 2, b
#define UD                               BANKMASK(ACTCON), 6, b
#define UG                               BANKMASK(OPA1CON0), 3, b
#define UG0                              BANKMASK(OPA1CON0), 3, b
#define UTH0                             BANKMASK(ADUTHL), 0, b
#define UTH1                             BANKMASK(ADUTHL), 1, b
#define UTH10                            BANKMASK(ADUTHH), 2, b
#define UTH11                            BANKMASK(ADUTHH), 3, b
#define UTH12                            BANKMASK(ADUTHH), 4, b
#define UTH13                            BANKMASK(ADUTHH), 5, b
#define UTH14                            BANKMASK(ADUTHH), 6, b
#define UTH15                            BANKMASK(ADUTHH), 7, b
#define UTH2                             BANKMASK(ADUTHL), 2, b
#define UTH3                             BANKMASK(ADUTHL), 3, b
#define UTH4                             BANKMASK(ADUTHL), 4, b
#define UTH5                             BANKMASK(ADUTHL), 5, b
#define UTH6                             BANKMASK(ADUTHL), 6, b
#define UTH7                             BANKMASK(ADUTHL), 7, b
#define UTH8                             BANKMASK(ADUTHH), 0, b
#define UTH9                             BANKMASK(ADUTHH), 1, b
#define UTHR                             BANKMASK(ADSTAT), 6, b
#define VREGPM0                          BANKMASK(VREGCON), 0, b
#define VREGPM1                          BANKMASK(VREGCON), 1, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPOL                             BANKMASK(SMT1CON0), 4, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WR1IE                            BANKMASK(I2C1PIE), 4, b
#define WR1IF                            BANKMASK(I2C1PIR), 4, b
#define WRERR                            BANKMASK(NVMCON1), 7, b
#define WRIE                             BANKMASK(I2C1PIE), 4, b
#define WRIF                             BANKMASK(I2C1PIR), 4, b
#define WS                               BANKMASK(SMT1STAT), 1, b
#define WSEL0                            BANKMASK(SMT1WIN), 0, b
#define WSEL1                            BANKMASK(SMT1WIN), 1, b
#define WSEL2                            BANKMASK(SMT1WIN), 2, b
#define WSEL3                            BANKMASK(SMT1WIN), 3, b
#define WSEL4                            BANKMASK(SMT1WIN), 4, b
#define XIP                              BANKMASK(DMAnCON0), 0, b
#define XOR0                             BANKMASK(CRCXORL), 0, b
#define XOR1                             BANKMASK(CRCXORL), 1, b
#define XOR10                            BANKMASK(CRCXORH), 2, b
#define XOR11                            BANKMASK(CRCXORH), 3, b
#define XOR12                            BANKMASK(CRCXORH), 4, b
#define XOR13                            BANKMASK(CRCXORH), 5, b
#define XOR14                            BANKMASK(CRCXORH), 6, b
#define XOR15                            BANKMASK(CRCXORH), 7, b
#define XOR16                            BANKMASK(CRCXORU), 0, b
#define XOR17                            BANKMASK(CRCXORU), 1, b
#define XOR18                            BANKMASK(CRCXORU), 2, b
#define XOR19                            BANKMASK(CRCXORU), 3, b
#define XOR2                             BANKMASK(CRCXORL), 2, b
#define XOR20                            BANKMASK(CRCXORU), 4, b
#define XOR21                            BANKMASK(CRCXORU), 5, b
#define XOR22                            BANKMASK(CRCXORU), 6, b
#define XOR23                            BANKMASK(CRCXORU), 7, b
#define XOR24                            BANKMASK(CRCXORT), 0, b
#define XOR25                            BANKMASK(CRCXORT), 1, b
#define XOR26                            BANKMASK(CRCXORT), 2, b
#define XOR27                            BANKMASK(CRCXORT), 3, b
#define XOR28                            BANKMASK(CRCXORT), 4, b
#define XOR29                            BANKMASK(CRCXORT), 5, b
#define XOR3                             BANKMASK(CRCXORL), 3, b
#define XOR30                            BANKMASK(CRCXORT), 6, b
#define XOR31                            BANKMASK(CRCXORT), 7, b
#define XOR4                             BANKMASK(CRCXORL), 4, b
#define XOR5                             BANKMASK(CRCXORL), 5, b
#define XOR6                             BANKMASK(CRCXORL), 6, b
#define XOR7                             BANKMASK(CRCXORL), 7, b
#define XOR8                             BANKMASK(CRCXORH), 0, b
#define XOR9                             BANKMASK(CRCXORH), 1, b
#define ZCDIE                            BANKMASK(PIE1), 1, a
#define ZCDIF                            BANKMASK(PIR1), 1, a
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR1), 1, b
#define ZCDMD                            BANKMASK(PMD1), 6, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define nBOR                             BANKMASK(PCON0), 0, a
#define nDONE                            BANKMASK(NVMCON0), 0, b
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRCM                             BANKMASK(PCON1), 0, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRVREG                           BANKMASK(PCON1), 2, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nWDTWV                           BANKMASK(PCON0), 5, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18F05Q41_INC_
